[
  {
    "companyName": "ADEVINTA",
    "slug": "ADEVINTA",
    "location": "Barcelona, Spain",
    "period": "SINCE APR 2020",
    "logo": "adevinta.jpg",
    "description": "Adevinta is a global digital player, the biggest marketplace specialist in Europe. Operating digital online classifieds in 12 countries.",
    "projects": [
      {
        "role": "Product Manager",
        "period": "SINCE OCT 2021",
        "description": "Taking my first steps as PM, contribuiting to establish the product strategy in the medium and long term, identifying opportunities and communicating them with a diverse range of stakeholders. Helping the team to be productive, defining KPIs to measure the impact and success of our products."
      },
      {
        "role": "Frontend Developer",
        "period": "APR 2020 - SEP 2021",
        "technologies": "JavaScript, Tailwind, Vue and Vuex",
        "description": "Wroked as a Senior Frontend Developer for a cross-platform team that develops a component that is used in different market places across various countries."
      }
    ]
  },
  {
    "companyName": "ServiteOnline",
    "slug": "ServiteOnline",
    "location": "Remote",
    "period": "SINCE JUL 2018",
    "logo": "servite.jpeg",
    "description": "E-commerce solution that helps stores to go digital.",
    "projects": [
      {
        "role": "CWO & Co Founder",
        "technologies": "JavaScript, Stencil, Ionic, React and TailwindCSS",
        "description": "I am one of the co-founders of ServiteOnline, a platform we created to help stores to digitalize their order management process.\nWe are currently in the process of increasing our customer base, improving our features, and enhancing the product along the way based on market needs.\nAbout my specific role, from a technical perspective, I am responsible for the Web applications, for both User and Admin entry points. And, putting the technical part aside, I work on the product vision and analysis (an area that I currently focusing on, crucial for the development of our platform), plus UI/UX concerns taking usability and innovation as our main driving values."
      }
    ]
  },
  {
    "companyName": "FRONTMEN",
    "slug": "FRONTMEN",
    "location": "Amsterdam, The Netherlands",
    "period": "FEB 2018 - MAR 2020",
    "logo": "frontmen.png",
    "description": "International frontend developers consultancy company.",
    "projects": [
      {
        "role": "Frontend Developer at Rabobank",
        "technologies": "JavaScript, AngularJs, Angular, Ionic, Stencil and Redux.",
        "description": "I worked as a Senior Frontend Developer in one of the main banks in The Netherlands, around 2.5 million customers in the country use Rabobank’s mobile banking services and many more people visit the website.\nIn this project I was part of the core Frontend platform team, helping to deliver the new development ecosystem that is now used across the entire organization (more than 400 developers). In this regard I have been actively involved in the decision-making when selecting, migrating, introducing, and implementing the new monorepo set-up (to enhance collaboration, code reachability, coordinated deployments & versioning amongst others) along with the new upcoming design iterations of the different applications we support."
      }
    ]
  },
  {
    "companyName": "MOBIQUITY",
    "slug": "MOBIQUITY",
    "location": "Amsterdam, The Netherlands",
    "period": "JUN 2017 - JAN 2018",
    "logo": "mobiquity.png",
    "description": "Within Mobiquity I worked as a Frontend Developer for different business domains.\nGained a lot of experience working in an international environment, and the interview recruiting process.",
    "projects": [
      {
        "technologies": "AngularJs, Angular, Protractor and Jasmine.",
        "role": "Frontend Developer at Backbase",
        "description": "I worked there as a Frontend consultant for this online banking platform for professional services, developing and helping the team to integrate and implement the UI (Web Apps and Hybrid Mobile Apps) of the company products with the different Bank cores systems."
      },
      {
        "technologies": "Angular and Ionic",
        "role": "Frontend Developer at The Children's Place",
        "description": "Worked as a Web Developer for an e-commerce hybrid Mobile Application called The Children's Place, based on the US."
      }
    ]
  },
  {
    "companyName": "NORSYNC",
    "slug": "NORSYNC",
    "location": "Tandil, Argentina",
    "period": "JAN 2016 - MAY 2017",
    "logo": "norsync.png",
    "description": "At Norsync where we worked in a startup model, I was really involved in all the phases of the development cycle of the projects. \nI also gained experience in other areas such as design and marketing.",
    "projects": [
      {
        "technologies": "AngularJs, Angular, Ionic, NodeJs, Protractor, Jasmine, Bootstrap and Gulp.",
        "role": "Fullstack Developer",
        "description": "Worked as a Web and Mobile Frontend Developer, where I developed several hybrid applications and web apps from scratch that are now still in production, including Application distribution into the different stores.\nRegarding the business domain, the applications were Booking systems, Ticket systems, and Live feed events applications, among others. These apps were implemented in stores such as restaurants, sports clubs, bars, and shopping."
      }
    ]
  },
  {
    "companyName": "SPARK DIGITAL",
    "slug": "SPARK DIGITAL",
    "location": "Tandil, Argentina",
    "period": "APR 2014 – DEC 2015",
    "logo": "sparkdigital.png",
    "description": "Within Devspark I did my first official step into Frontend development, something that I was already doing in my free time.\nI also gained experience in integration strategies, management, and team building. I had direct contact with many stakeholders from several backgrounds and their clients.",
    "projects": [
      {
        "technologies": "Django, Heroku, AngularJs, JQuery, Protractor, jasmine, SASS, CSS, Bootstrap, and Grunt.",
        "role": "Software Engineer at Likeminder",
        "description": "I led the development of a SPA. A private online social media called Likeminder, which allows users to share and support private and emotional conversations.\nSince we were a small team, I was involved in all technical and non-technical discussions related to the end product, and also was able to refactor the Application to improve several aspects that were missing at the moment that we took over it."
      },
      {
        "technologies": "APIGee products, JavaScript, RESTful, Jmeter and SoapUI.",
        "role": "Software Engineer at Coca-Cola",
        "description": "I worked as an APIgee 4G developer, which is a cloud-based platform for APIs.\nMy duties were the design and development of RESTful APIs into Apigee Platform, in order to expose automatic digital supply chain services to increase the platform’s integration capabilities with third-party applications; application’s issue diagnostics and resolution; deployment management; and customer service orientation."
      }
    ]
  },
  {
    "companyName": "Grupo Assa",
    "slug": "Grupo Assa",
    "location": "Tandil, Argentina",
    "period": "NOV 2011 - NOV 2012",
    "logo": "grupoassa.png",
    "description": "As this was my first IT-related job, I gained experience in multinational organizations, customer care, and working with distributed remote teams.",
    "projects": [
      {
        "technologies": "JD Edwards, Oracle SQL, ERP technologies related and C/C++.",
        "role": "Technical Consultant at Johnson & Johnson",
        "description": "Worked as a JD Edwards developer, an Enterprise Resource Planning.\nMy responsibilities included business process optimization, in order to improve our client’s business activities such as sales, deliveries, payments, production, inventory administration, and administration quality; review code for quality and adherence to standards; and, apply and analyze business requests to determine how best to create a successful resolution."
      }
    ]
  }
]
